import 'dart:developer';

import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:animated_custom_dropdown/custom_dropdown.dart';
import 'package:quran2/start/splashscreen.dart';
import 'package:shared_preferences/shared_preferences.dart';

import 'app/pages/praise/zekr.dart';

const List<String> _list = [
  'اذكار الصباح',
  '(اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ).',
  '(قُلْ هُوَ اللَّهُ أَحَدٌ - اللَّهُ الصَّمَدُ - لَمْ يَلِدْ وَلَمْ يُولَدْ - وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ) - (ثلاث مرات)',
  '(قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ - مِن شَرِّ مَا خَلَقَ- وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ - وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ - وَمِن شَرِّ حَاسِد إِذَا حَسَد) - (ثلاث مرات).',
  '(قُلْ أَعُوذُ بِرَبِّ النَّاسِ - مَلِكِ النَّاسِ - إِلَٰهِ النَّاسِ - مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ - الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ - مِنَ الْجِنَّةِ وَالنَّاس) - (ثلاث مرات).',
  '(أصْبَحْنا وَأَصْبَحَ المُلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كلّ شَيءٍقدير، رَبِّ أسْأَلُكَ خَيرَ ما في هذا اليوم وَخَيرَ ما بَعْدَه وَأَعوذُ بِكَ مِنْ شَرِّ ما في هذا اليوم وَشَرِّ ما بَعْدَه، رَبِّ أَعوذُ بِكَ مِنَ الْكَسَلِ وَسوءِ الْكِبَر، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ في النّارِ وَعَذابٍ في القَبْر).',
  '(اللّهُمَّ بِكَ أَصْبَحْنا، وَبِكَ أَمْسَينا، وَبِكَ نَحْيا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النشورُ).',
  '(اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي، فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ).',
  '(اللَّهمَّ ما أصبحَ بي من نعمةٍ أو بأحدٍ من خلقِكَ فمنكَ وحدَكَ لا شريكَ لكَ فلكَ الحمدُ ولكَ الشُّكرُ)',
  '(اللَّهُمَّ إنِّي أصبَحتُ أُشهِدُك وأُشهِدُ حَمَلةَ عَرشِكَ ومَلائِكَتَك وجميعَ خَلقِكَ، أنَّكَ أنتَ اللهُ لا إلهَ إلَّا أنتَ وأنَّ مُحمَّدًا عبدُكَ ورسولُكَ)',
  '(اللَّهمَّ ما أصبحَ بي من نعمةٍ أو بأحدٍ من خلقِكَ فمنكَ وحدَكَ لا شريكَ لكَ فلكَ الحمدُ ولكَ الشُّكرُ)',
  '(اللَّهمَّ عافِني في بدَني اللَّهمَّ عافِني في سمعي اللَّهمَّ عافِني في بصري لا إلهَ إلَّا أنت، اللَّهمَّ إنِّي أعوذُ بِكَ منَ الكُفْرِ والفقرِ اللَّهمَّ إنِّي أعوذُ بكَ من عذابِ القبرِ لا إلهَ إلَّا أنت)، (ثلاث مرات).',
];

class Test extends StatefulWidget {
  const Test({super.key});

  @override
  State<Test> createState() => _TestState();
}

class _TestState extends State<Test> {
  final jobRoleCtrl = TextEditingController();

  @override
  Widget build(BuildContext context) {
    ss();
    log("mahmoud");
    return Scaffold(
        appBar: AppBar(),
        body: CustomDropdown<String>(
          hintText: 'Select job role',
          items: _list,
          initialItem: _list[0],
          onChanged: (value) {},
        ));
  }
}

ss() async {
  SharedPreferences prefs = await SharedPreferences.getInstance();
  prefs.getBool("notificationSwitch") == true
      ? showNotification()
      : print("sheet");
}
